src/cf/Documents/вогРаспределениеDIYПоНоменклатурнымГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>вогРаспределениеDIYПоНоменклатурнымГруппам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.вогРаспределениеDIYПоНоменклатурнымГруппам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеDIY</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоШахты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБереза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУфа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПечоры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКерамин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПланированияПродажПлиткаКвартал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПланированияПродажПлиткаКвартал</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КорректировкаКоличествоВОФактУПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланВыставленияСледующийКвартал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РотацияПанелей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоШоуРум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьШоуРум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПланСледующийКвартал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентУценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерчендайзингАкция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерчендайзингIndoor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерчендайзингOutdoor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотенциальнойТорговойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотенциальнойТорговойТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомплектПанелей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомплектыПанелейДляПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогРаспределениеDIYПоНоменклатурнымГруппам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогРаспределениеDIYПоНоменклатурнымГруппам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/CRM_ЗначенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ЗначенияКлассификаторов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.CRM_Классификаторы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/вогРаспределениеDIYПоНоменклатурнымГруппам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Пользователи.ЭтоПолноправныйПользователь(Пользователи.ТекущийПользователь()) Тогда
		Элементы.Ответственный.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() тогда
		// ++ VOG Солодов В.В. 24.03.2021 DEV-260
		Объект.Дата = ТекущаяДата();
		Если Параметры.Свойство("СценарийПланирования") Тогда
			Объект.СценарийПланирования = Параметры.СценарийПланирования;
		Иначе
			Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод;
		КонецЕсли;
		
		Если Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал Тогда
			Объект.ПериодПланирования = КонецКвартала(Объект.Дата) + 1;
		Иначе
			// ++ VOG Солодов В.В. 14.10.2021 CRM-1246
			Объект.ПериодПланирования = вогОбщегоНазначенияКлиентСервер.ПолучитьГодПланирования(Истина);
			// До изменения
			//Объект.ПериодПланирования = Дата(Константы.ГодПланированияПлитка.Получить(), 1, 1);
			// -- VOG Солодов В.В. 14.10.2021 CRM-1246
		КонецЕсли;
		// До изменения
		//Объект.ПериодПланирования = Дата(Константы.ГодПланированияПлитка.Получить(),1,1);
		//Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод;
		// -- VOG Солодов В.В. 24.03.2021 DEV-260
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	вогВерсииСценариевПланирования.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вогВерсииСценариевПланирования КАК вогВерсииСценариевПланирования
		|ГДЕ
		|	вогВерсииСценариевПланирования.Владелец = &Владелец
		|	И вогВерсииСценариевПланирования.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Владелец",Объект.СценарийПланирования);
		Запрос.УстановитьПараметр("Наименование","Основная");
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Объект.ВерсияСценария = Выборка.Ссылка;
		
		//+++ Терпогосян Д.Б. [06.08.2021 17:26:29] № DEV-743
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(	ТекущийПользователь, "Подразделение", Истина);
		Объект.Подразделение  = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(	РеквизитыПользователя.Подразделение);
		//--- Терпогосян Д.Б. [06.08.2021 17:26:35] № DEV-743 

	КонецЕсли;
	
	// ++ VOG Солодов В.В. 14.10.2021 CRM-1253
	Если Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ПериодПланирования",
			"Доступность",
			Ложь);
		
	КонецЕсли;
	// -- VOG Солодов В.В. 14.10.2021 CRM-1253
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьРазность();	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьРазность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//+++ Терпогосян Д.Б. [06.08.2021 16:52:01] № DEV-743
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//--- Терпогосян Д.Б. [06.08.2021 16:52:07] № DEV-743 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыРаспределениеDIY

&НаКлиенте
Процедура РаспределениеDIYПриИзменении(Элемент)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ТекущаяСтрока.КоличествоРазница = ТекущаяСтрока.КоличествоИтого - ТекущаяСтрока.КоличествоБереза - ТекущаяСтрока.КоличествоПечоры - ТекущаяСтрока.КоличествоУфа - ТекущаяСтрока.КоличествоШахты - ТекущаяСтрока.КоличествоКерамин - ТекущаяСтрока.КоличествоИК;
	
	//--> VOG Турский Сергей 28.06.2021 9:40:35 ID заявки: DEV-682.
	ПоказатьИтогРаспределениеDIYКоличествоРазница();
	//<-- VOG Турский Сергей 28.06.2021 9:40:41 ID заявки: DEV-682.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.РаспределениеDIY.Количество() = 0 Тогда
		ЗаполнитьНаСервере();
		//--> VOG Турский Сергей 24.06.2021 10:31:12 ID заявки: DEV-682.
		ПоказатьИтогРаспределениеDIYКоличествоРазница();
		//<-- VOG Турский Сергей 24.06.2021 10:31:24 ID заявки: DEV-682.
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.РаспределениеDIY.Очистить();
		ЗаполнитьНаСервере();
	КонецЕсли;

	//--> VOG Турский Сергей 24.06.2021 10:31:46 ID заявки: DEV-682.
	ПоказатьИтогРаспределениеDIYКоличествоРазница();
	//<-- VOG Турский Сергей 24.06.2021 10:31:51 ID заявки: DEV-682.
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьИтогРаспределениеDIYКоличествоРазница() //--> VOG Турский Сергей 24.06.2021 10:22:40 ID заявки: DEV-682. 
	
	ИтогКоличествоРазница 										= Объект.РаспределениеDIY.Итог("КоличествоРазница"); 
	Элементы.РаспределениеDIYКоличествоРазница.ТекстПодвала 	= Формат(ИтогКоличествоРазница, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	
КонецПроцедуры // ПоказатьИтогРаспределениеDIYКоличествоРазница()

&НаКлиенте
Процедура ОбновитьРазность()
	
	Для Каждого Строка Из Объект.РаспределениеDIY Цикл
		Строка.КоличествоРазница = Строка.КоличествоИтого - Строка.КоличествоБереза - Строка.КоличествоПечоры - Строка.КоличествоУфа - Строка.КоличествоШахты - Строка.КоличествоКерамин - Строка.КоличествоИК;
	КонецЦикла;
	
	//--> VOG Турский Сергей 24.06.2021 10:29:28 ID заявки: DEV-682.
	ПоказатьИтогРаспределениеDIYКоличествоРазница();
	//<-- VOG Турский Сергей 24.06.2021 10:29:33 ID заявки: DEV-682.
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	// ++ VOG Солодов В.В. 24.03.2021 DEV-260
	// Вынесено в отдельную функцию
	Запрос.Текст = ТекстЗапросаЗаполнения();
	// -- VOG Солодов В.В. 24.03.2021 DEV-260
	
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПериодПланирования", Объект.ПериодПланирования);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("СценарийПланирования", Объект.СценарийПланирования);
	Запрос.УстановитьПараметр("ВерсияПланирования", Объект.ВерсияСценария);
	Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Пользователи.ТекущийПользователь().Подразделение));
	// УИД в тич2 и в рабочей
	Запрос.УстановитьПараметр("Бренд", Справочники.вогБренды.ПолучитьСсылку(Новый УникальныйИдентификатор("3d471c0e-66b1-11e3-b895-005056ac8899")));
	
	КомплектПанелей = Новый Массив();
	
	// УИД в тич2
	//Запрос.УстановитьПараметр("КомплектПанелейDIY", Справочники.КомплектыПанелейДляПланирования.ПолучитьСсылку(Новый УникальныйИдентификатор("ac07b980-f99d-11ea-8314-005056bc3fe8")));
	//Запрос.УстановитьПараметр("КомплектПанелейОборудование", Справочники.КомплектыПанелейДляПланирования.ПолучитьСсылку(Новый УникальныйИдентификатор("31593273-03f8-11eb-8314-005056bc3fe8")));
	// УИД в рабочей
	Запрос.УстановитьПараметр("КомплектПанелейDIY", Справочники.КомплектыПанелейДляПланирования.ПолучитьСсылку(Новый УникальныйИдентификатор("a2c32dab-07a5-11eb-8f2a-005056bcd3e3"))); 
	Запрос.УстановитьПараметр("КомплектПанелейОборудование", Справочники.КомплектыПанелейДляПланирования.ПолучитьСсылку(Новый УникальныйИдентификатор("a2c32dac-07a5-11eb-8f2a-005056bcd3e3"))); 
	//+++ Терпогосян Д.Б. [16.08.2021 12:12:26] № DEV-862
	Запрос.УстановитьПараметр("КомплектСтойкаМалая1560", Справочники.КомплектыПанелейДляПланирования.ПолучитьСсылку(Новый УникальныйИдентификатор("d406e343-c792-11eb-bad0-005056bcd3e3"))); 
	//--- Терпогосян Д.Б. [16.08.2021 12:12:37] № DEV-862 
	
	 
	
	// в базе teach2
	//RDIY = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("b621a49f-03a9-11eb-8314-005056bc3fe8"));
	// в рабочей базе
	RDIY = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("6cac4f07-06d3-11eb-8f2a-005056bcd3e3"));
	
	//	в базе teach2
	//FDIY = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("9e4df14d-03a9-11eb-8314-005056bc3fe8"));
	// в рабочей базе
	FDIY = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("64a60c68-06d3-11eb-8f2a-005056bcd3e3"));
	
	// в базе тич 2 и в рабочей
	DIY = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("4fc40649-ada2-11e7-80ce-08606e7382bc"));
	
	ФорматТРТ = Новый Массив;
	ФорматТРТ.Добавить(RDIY);
	ФорматТРТ.Добавить(FDIY);
	ФорматТРТ.Добавить(DIY);
	Запрос.УстановитьПараметр("ФорматТРТ",ФорматТРТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлиент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НГБерезы = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("23f84ea5-6868-11e7-9071-005056acd97c"));
	НГПечоры = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("75e9b0e1-ec17-11e5-b10e-005056acd97c"));
	НГУфа = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("08fced4f-9215-11e3-ba76-005056ac259f"));
	НГШахты = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("ee883a10-6867-11e7-9071-005056acd97c"));
	НГКерамин = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("c086e912-43d3-11e8-8a33-005056acd97c"));
	// в базе тич2
	//НГИК = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("0999a0c5-2a43-11eb-872a-005056bc3fe8"));
	// в рабочей базе
	НГИК = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("0298e138-2a43-11eb-abef-005056bcd3e3"));
	
	Пока ВыборкаКлиент.Следующий() Цикл
		
		НоваяСтрока = Объект.РаспределениеDIY.Добавить();
		НоваяСтрока.Клиент = ВыборкаКлиент.Клиент;
		
		ВыборкаДетальныеЗаписи = ВыборкаКлиент.Выбрать();
				
		СуммаПоКлиенту = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа = НГБерезы Тогда
				НоваяСтрока.КоличествоБереза = ВыборкаДетальныеЗаписи.КоличествоПлан;
			ИначеЕсли ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа = НГПечоры Тогда
				НоваяСтрока.КоличествоПечоры = ВыборкаДетальныеЗаписи.КоличествоПлан;
			ИначеЕсли ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа = НГУфа Тогда
				НоваяСтрока.КоличествоУфа = ВыборкаДетальныеЗаписи.КоличествоПлан;
			ИначеЕсли ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа = НГШахты Тогда
				НоваяСтрока.КоличествоШахты = ВыборкаДетальныеЗаписи.КоличествоПлан;
			ИначеЕсли ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа = НГКерамин Тогда
				НоваяСтрока.КоличествоКерамин = ВыборкаДетальныеЗаписи.КоличествоПлан;
			ИначеЕсли ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа = НГИК Тогда
				НоваяСтрока.КоличествоИК = ВыборкаДетальныеЗаписи.КоличествоПлан;
			КонецЕсли;
			
			НоваяСтрока.КоличествоИтого = ВыборкаДетальныеЗаписи.КоличествоПланПоправочное;
			
			СуммаПоКлиенту = СуммаПоКлиенту + ВыборкаДетальныеЗаписи.КоличествоПлан;
			
		КонецЦикла;
		
		
		
		НоваяСтрока.КоличествоРазница = НоваяСтрока.КоличествоИтого - СуммаПоКлиенту;
		
	КонецЦикла;
	
	
КонецПроцедуры

// ++ VOG Солодов В.В. 24.03.2021 DEV-260
&НаСервере
Функция ТекстЗапросаЗаполнения()
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	вогТорговыеТочки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_ТорговыеТочки
	|ИЗ
	|	Справочник.вогТорговыеТочки КАК вогТорговыеТочки
	|ГДЕ
	|	НЕ вогТорговыеТочки.ПометкаУдаления");
	
	Если Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал Тогда
		
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПланированияПродажПлиткаDIY.ТорговаяТочка.Партнер КАК Клиент,
		|	СУММА(ЕСТЬNULL(ДанныеПланированияПродажПлиткаDIY.КоличествоПланСледующийКвартал, 0)) КАК КоличествоПланПоправочное
		|ПОМЕСТИТЬ вт_ДанныеПланирования
		|ИЗ
		|	вт_ТорговыеТочки КАК вт_ТорговыеТочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПланированияПродажПлиткаКвартал.СрезПоследних(
		|				&ТекущаяДата,
		|				ПериодПланирования = &ПериодПланирования
		|					И СценарийПланирования = &СценарийПланирования
		|					И Версия = &ВерсияПланирования
		|					И Бренд = &Бренд
		|					И КомплектПанелей В (&КомплектПанелейDIY, &КомплектПанелейОборудование, &КомплектСтойкаМалая1560)) КАК ДанныеПланированияПродажПлиткаDIY
		|		ПО вт_ТорговыеТочки.Ссылка = ДанныеПланированияПродажПлиткаDIY.ТорговаяТочка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПланированияПродажПлиткаDIY.ТорговаяТочка.Партнер
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(ДанныеПланированияПродажПлиткаDIY.КоличествоПланСледующийКвартал, 0)) > 0");
		
	Иначе
		
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПланированияПродажПлиткаDIY.ТорговаяТочка.Партнер КАК Клиент,
		|	СУММА(ЕСТЬNULL(ДанныеПланированияПродажПлиткаDIY.КоличествоПланПоправочное, 0)) КАК КоличествоПланПоправочное
		|ПОМЕСТИТЬ вт_ДанныеПланирования
		|ИЗ
		|	вт_ТорговыеТочки КАК вт_ТорговыеТочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПланированияПродажПлитка.СрезПоследних(
		|				&ТекущаяДата,
		|				ПериодПланирования = &ПериодПланирования
		|					И Сценарий = &СценарийПланирования
		|					И Версия = &ВерсияПланирования
		|					И Бренд = &Бренд
		|					И КомплектПанелей = &КомплектПанелейDIY) КАК ДанныеПланированияПродажПлиткаDIY
		|		ПО вт_ТорговыеТочки.Ссылка = ДанныеПланированияПродажПлиткаDIY.ТорговаяТочка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПланированияПродажПлиткаDIY.ТорговаяТочка.Партнер
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(ДанныеПланированияПродажПлиткаDIY.КоличествоПланПоправочное, 0)) > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеПланированияПродажПлиткаОборудование.ТорговаяТочка.Партнер,
		|	СУММА(ЕСТЬNULL(ДанныеПланированияПродажПлиткаОборудование.КоличествоПланПоправочное, 0))
		|ИЗ
		|	вт_ТорговыеТочки КАК вт_ТорговыеТочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПланированияПродажПлитка.СрезПоследних(
		|				&ТекущаяДата,
		|				ПериодПланирования = &ПериодПланирования
		|					И Сценарий = &СценарийПланирования
		|					И Версия = &ВерсияПланирования
		|					И Бренд = &Бренд
		|					И КомплектПанелей = &КомплектПанелейОборудование) КАК ДанныеПланированияПродажПлиткаОборудование
		|		ПО вт_ТорговыеТочки.Ссылка = ДанныеПланированияПродажПлиткаОборудование.ТорговаяТочка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПланированияПродажПлиткаОборудование.ТорговаяТочка.Партнер
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(ДанныеПланированияПродажПлиткаОборудование.КоличествоПланПоправочное, 0)) > 0");
		
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ
	|	вт_ДанныеПланирования.Клиент КАК Клиент,
	|	СУММА(вт_ДанныеПланирования.КоличествоПланПоправочное) КАК КоличествоПланПоправочное
	|ПОМЕСТИТЬ втДанныеКлиент
	|ИЗ
	|	вт_ДанныеПланирования КАК вт_ДанныеПланирования
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ДанныеПланирования.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеПланирования.Клиент КАК Клиент,
	|	вт_ДанныеПланирования.КоличествоПланПоправочное КАК КоличествоПланПоправочное,
	|	вогРаспределениеDIYПоНоменклатурнымГруппамСрезПоследних.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ЕСТЬNULL(вогРаспределениеDIYПоНоменклатурнымГруппамСрезПоследних.КоличествоПлан, 0)) КАК КоличествоПлан
	|ИЗ
	|	втДанныеКлиент КАК вт_ДанныеПланирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогРаспределениеDIYПоНоменклатурнымГруппам.СрезПоследних(
	|				&ДатаДокумента,
	|				Регистратор <> &Регистратор
	|					И СценарийПланирования = &СценарийПланирования
	|					И ВерсияСценария = &ВерсияПланирования
	|					И ПериодПланирования = &ПериодПланирования) КАК вогРаспределениеDIYПоНоменклатурнымГруппамСрезПоследних
	|		ПО вт_ДанныеПланирования.Клиент = вогРаспределениеDIYПоНоменклатурнымГруппамСрезПоследних.Клиент
	|			И (вогРаспределениеDIYПоНоменклатурнымГруппамСрезПоследних.Подразделение = &Подразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ДанныеПланирования.Клиент,
	|	вт_ДанныеПланирования.КоличествоПланПоправочное,
	|	вогРаспределениеDIYПоНоменклатурнымГруппамСрезПоследних.НоменклатурнаяГруппа
	|ИТОГИ ПО
	|	Клиент");
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции // -- VOG Солодов В.В. 24.03.2021 DEV-260

#КонецОбласти
